app/controllers/api/v1/events_controller.rb

SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1  [["event_id", 1]]
---
  def index
    @events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find_by(id: params[:id])

INSERT INTO "events" ("user_id", "name", "url", "image1", "image2", "start_date", "start_time", "segment", "genre", "venue", "city", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @event = Event.create(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    @event = Event.find_by(id: params[:id])
    @event.destroy