app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "user"], ["email", "ben1232jazz@wsu.edu"], ["created_at", "2019-03-26 22:11:53.508801"], ["updated_at", "2019-03-26 22:11:53.508801"]]
---
  def create
    @user = User.create(user_params)